       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
      *Program that prints "Hello, World!" to the screen.
       AUTHOR Nils Müller.
       DATE-WRITTEN 2024-11-03.
       PROCEDURE DIVISION.
       DisplayPrompt.
           DISPLAY "Hello, World!".
       

